//=========================================================
//
// ユーザーデータ
//
//=========================================================

let maccoto = {
	id: 'U5MPH15RU',
	name: 'ご主人',
	birthday: '19880828',
	like: {
		ramen: ['河童ラーメン', '天下一品', '中華そば 葛', 'ふく流ラパス 分家 ワダチ', '鶏Soba 座銀']
	}
}

let kichi = {
	id: 'U5M2E7GTW',
	name: ['みゆきち', 'あきお', 'きっち', 'きち子', 'きちみゆ', 'こーきちろう', 'きち', 'きっちゃん'],
	birthday: '19801226',
	like: {
		sanuki: {
			dinner: ['日高屋', '木屋', '四季亭', '四季蕎麦', 'カリカ', '紅光', 'Grano', 'サガル', 'しちりん']
		}
	}
}
