//=========================================================
//
// チンプキン ヘルプ
//
//=========================================================
'use strict'
module.exports = controller => {

	controller.hears('何が出来る',['direct_message','direct_mention','mention','ambient'],function(bot,message) {
		bot.reply(message,
			'*■ 今何年？後何日？*\n' +
			'> 今が西暦何年で、平成何年か教えるよー。\n' +
			'```今(.*)何年```\n' +
			'\n' +
			'> 日付のカウントダウンするよー\n' +
			'```(.*)年(.*)月(.*)日```\n' +
			'\n' +
			'*■ 干支教えてー*\n' +
			'> 干支教えるよ！\n' +
			'```干支教えて```\n' +
			'```(.*)年の干支```\n' +
			'\n' +
			'*■ ご当地キャラ*\n' +
			'> ご当地キャラを調べるよ！\n' +
			'```(.*)のご当地キャラ```\n' +
			'\n' +
			'*■ おみくじ*\n' +
			'> おみくじ出来るよ！\n' +
			'```おみくじ```\n' +
			'\n' +
			'*■ 星座占い*\n' +
			'> 占うよ！\n' +
			'```(.*)の運勢```\n' +
			'\n' +
			'*■ カウントダウン*\n' +
			'> カウントダウンでどかーん！\n' +
			'```カウントダウン(.*)秒前```\n' +
			'\n' +
			'*■ wikipedia*\n' +
			'> wikipediaで調べてくるよ！\n' +
			'```(.*)って何```\n'
		)
	})

}