//=========================================================
//
// ユーザーデータ
//
//=========================================================
'use strict'
module.exports = controller => {

	global.maccoto = {
		id: 'U5MPH15RU',
		name: 'ご主人',
		birth: {
			year: '1988',
			month: '08',
			day: '28'
		},
		like: {
			ramen: ['河童ラーメン', '天下一品', '中華そば 葛', 'ふく流ラパス 分家 ワダチ', '鶏Soba 座銀']
		}
	}

	global.kichi = {
		id: 'U5M2E7GTW',
		name: ['みゆきち', 'あきお', 'きっち', 'きち子', 'きちみゆ', 'こーきちろう', 'きち', 'きっちゃん'],
		birth: {
			year: '1980',
			month: '12',
			day: '26'
		},
		like: {
			sanuki: {
				dinner: ['日高屋', '木屋', '四季亭', '四季蕎麦', 'カリカ', '紅光', 'Grano', 'サガル', 'しちりん']
			}
		}
	}

	global.chimpkin = {
		name: ['チンプキン', 'チンプさん', 'プキン'],
		birth: {
			year: '2017',
			month: '06',
			day: '25'
		}
	}
}